In [40]:
#Importing the Libraries
import pandas as pd

In [41]:
#Reading csv file using pandas.read_csv and saved in dataset variable
dataset=pd.read_csv("Placement.csv")

In [42]:
dataset

,sl_no,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status,salary
0,1,M,67.00,Others,91.00,Others,Commerce,58.00,Sci&Tech,No,55.0,Mkt&HR,58.80,Placed,270000.0
1,2,M,79.33,Central,78.33,Others,Science,77.48,Sci&Tech,Yes,86.5,Mkt&Fin,66.28,Placed,200000.0
2,3,M,65.00,Central,68.00,Central,Arts,64.00,Comm&Mgmt,No,75.0,Mkt&Fin,57.80,Placed,250000.0
3,4,M,56.00,Central,52.00,Central,Science,52.00,Sci&Tech,No,66.0,Mkt&HR,59.43,Not Placed,NaN
4,5,M,85.80,Central,73.60,Central,Commerce,73.30,Comm&Mgmt,No,96.8,Mkt&Fin,55.50,Placed,425000.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
210,211,M,80.60,Others,82.00,Others,Commerce,77.60,Comm&Mgmt,No,91.0,Mkt&Fin,74.49,Placed,400000.0
211,212,M,58.00,Others,60.00,Others,Science,72.00,Sci&Tech,No,74.0,Mkt&Fin,53.62,Placed,275000.0
212,213,M,67.00,Others,67.00,Others,Commerce,73.00,Comm&Mgmt,Yes,59.0,Mkt&Fin,69.72,Placed,295000.0
213,214,F,74.00,Others,66.00,Others,Commerce,58.00,Comm&Mgmt,No,70.0,Mkt&HR,60.23,Placed,204000.0
214,215,M,62.00,Central,58.00,Others,Science,53.00,Comm&Mgmt,No,89.0,Mkt&HR,60.22,Not Placed,NaN

In [43]:
#From py File importing Class and save into a obj variable
from Univarite import Univarite
obj=Univarite()

In [44]:
#From  class importing QuanQual function and save into a quan,qual variable
quan,qual=obj.QuanQual(dataset)

Quan: ['sl_no', 'ssc_p', 'hsc_p', 'degree_p', 'etest_p', 'mba_p', 'salary']
Qual: ['gender', 'ssc_b', 'hsc_b', 'hsc_s', 'degree_t', 'workex', 'specialisation', 'status']

In [45]:
#Average performance of 10th mark of these college student is 67 for mean
dataset["ssc_p"].mean()

67.3033953488372

In [46]:
#Average performance of 10th mark of these college student is 67 for median
dataset["ssc_p"].median()

67.0

In [47]:
#Average performance of 10th mark of these college student is 62 for mode
dataset["ssc_p"].mode()[0]

62.0

In [48]:
#Creating a empty table and saved into a univariate variable
univariate=pd.DataFrame(index=["Mean","Median","Mode"],columns=quan)

In [49]:
#For access a perticular cell first enter a column name and next row name
univariate["ssc_p"]["Mean"]

nan

In [50]:
#using for loop to print mean,median,mode values under the quan column
for column in quan:
    univariate[column]["Mean"]=dataset[column].mean()
    univariate[column]["Median"]=dataset[column].median()
    univariate[column]["Mode"]=dataset[column].mode()[0]

In [51]:
univariate
#Most of these college students are get 60 to 67 percentage in every scc,hsc and degree. so they get salary upto 288655.
#suppose they get more percentage they get more salary

       sl_no    ssc_p    hsc_p degree_p  etest_p    mba_p  salary
Mean     108  67.3034  66.3332  66.3702  72.1006  62.2782  288655
Median   108       67       65       66       71       62  265000
Mode       1       62       63       65       60     56.7  300000

In [52]:
dataset.describe()

,sl_no,ssc_p,hsc_p,degree_p,etest_p,mba_p,salary
count,215.000000,215.000000,215.000000,215.000000,215.000000,215.000000,148.000000
mean,108.000000,67.303395,66.333163,66.370186,72.100558,62.278186,288655.405405
std,62.209324,10.827205,10.897509,7.358743,13.275956,5.833385,93457.452420
min,1.000000,40.890000,37.000000,50.000000,50.000000,51.210000,200000.000000
25%,54.500000,60.600000,60.900000,61.000000,60.000000,57.945000,240000.000000
50%,108.000000,67.000000,65.000000,66.000000,71.000000,62.000000,265000.000000
75%,161.500000,75.700000,73.000000,72.000000,83.500000,66.255000,300000.000000
max,215.000000,89.400000,97.700000,91.000000,98.000000,77.890000,940000.000000

In [96]:
#calculating the percentage
#eg:99% students take less than 87 mark 1% students only take more than 87 marks
import numpy as np
np.percentile(dataset["ssc_p"],50)

67.0

In [54]:
#Replacing NaN as Zero
dataset["salary"]=dataset["salary"].fillna(0)

In [55]:
univariate=pd.DataFrame(index=["Mean","Median","Mode","Min","25%","50%","75%","Max"],columns=quan)

In [56]:
for column in quan:
    univariate[column]["Mean"]=dataset[column].mean()
    univariate[column]["Median"]=dataset[column].median()
    univariate[column]["Mode"]=dataset[column].mode()[0]
    univariate[column]["Min"]=dataset[column].min()
    univariate[column]["25%"]=np.percentile(dataset[column],25)
    univariate[column]["50%"]=np.percentile(dataset[column],50)
    univariate[column]["75%"]=np.percentile(dataset[column],75)
    univariate[column]["Max"]=np.percentile(dataset[column],100)

In [57]:
univariate

        sl_no    ssc_p    hsc_p degree_p  etest_p    mba_p  salary
Mean      108  67.3034  66.3332  66.3702  72.1006  62.2782  198702
Median    108       67       65       66       71       62  240000
Mode        1       62       63       65       60     56.7       0
Min         1    40.89       37       50       50    51.21       0
25%      54.5     60.6     60.9       61       60   57.945       0
50%       108       67       65       66       71       62  240000
75%     161.5     75.7       73       72     83.5   66.255  282500
Max       215     89.4     97.7       91       98    77.89  940000

In [98]:
import numpy as np
np.percentile(dataset["salary"],99)

628999.9999999977

In [73]:
import numpy as np
np.percentile(dataset["salary"],100)

940000.0

In [ ]:
#Descriptive
#25% of person are scored upto 60 in ssc
#25% of person are scored upto 60 in hsc
#25% of person are scored upto 61 in degree
#25% of person are scored upto 60 in etest
#25% of person are scored upto 57 in mba
#25% of person are not placed salary=0
#75% of person are scored upto 75 in ssc
#75% of person are scored upto 73 in hsc
#75% of person are scored upto 72 in degree
#75% of person are scored upto 83 in etest
#75% of person are scored upto 66 in mba
#75% of person are placed salary=282500
#Max person are scored upto 89 in ssc
#Max person are scored upto 97 in hsc
#Max person are scored upto 91 in degree
#Max person are scored upto 98 in etest
#Max person are scored upto 77 in mba
#Max person are placed salary=940000 there is some outliers

In [ ]:
#Inference
#50% of these college students are scored 60 to 67  in every scc,hsc and degree. so they get salary upto 288655.
#Highly scored person are get more salary .
# Also 99% of persons get salary upto 628999 but 1% of person get salary upto 940000 there is some outliers.